heisenman/home-automation/edge/esp32s3-shades/sdkconfig.defaults
# Defaults applied on first `idf.py set-target esp32s3`. Edit sdkconfig (not this) for local tweaks.

CONFIG_IDF_TARGET="esp32s3"

# ── Bluetooth: enabled so ha_mqtt's (unconditional) BLE dependencies COMPILE, but NimBLE is never
#    initialised and never called — CONFIG_HA_MQTT_NO_BLE below compiles out every use, including the OTA
#    radio-pause seam. This node has no BLE role. See firmware/components/ha_mqtt/CMakeLists.txt for why
#    the dependency cannot simply be dropped (IDF expands REQUIRES before sdkconfig exists).
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y

# ── Flash + PSRAM: the N16R8 module is 16 MB flash + 8 MB OCTAL PSRAM ───────────
# ⚠️ Octal PSRAM permanently consumes GPIO 33–37 (26–32 are the SPI flash). The pin map in app_main.c
# avoids both ranges. Changing these settings does NOT free those pins — the module is wired that way.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_OCT_FLASH=n
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# ── Partition table: custom A/B OTA layout ─────────────────────────────────────
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ── OTA rollback: the bootloader auto-reverts to the last-good slot if a freshly-OTA'd app fails its
#    self-test. Matters more here than on a sensor node: a shade node that boots broken still has 18
#    contacts wired to a panel that latches if one is held.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y

# ── ha_mqtt without BLE ────────────────────────────────────────────────────────
# This node drives contacts; it has no BLE role. Drops ha_gatt/ha_gatt_exec/ha_ble_scan (which REQUIRE
# `bt`) and compiles out the BLE-only ops, rather than linking the whole NimBLE stack for a radio we
# never use. The signed-command gate, OTA and publish paths are unaffected.
CONFIG_HA_MQTT_NO_BLE=y

# ── Misc ───────────────────────────────────────────────────────────────────────
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
